; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-7)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
    b6 - block
    b7 - block
    b8 - block
    b9 - block
    b10 - block
    b11 - block
    b12 - block
    b13 - block
    b14 - block
  )

  (:init
    (ontable b6)
    (on b5 b6)
    (ontable b8)
    (on b3 b8)
    (ontable b1)
    (on b12 b1)
    (ontable b14)
    (on b13 b14)
    (ontable b2)
    (on b7 b2)
    (ontable b9)
    (on b10 b9)
    (ontable b11)
    (ontable b4)
    (clear b5)
    (clear b3)
    (clear b12)
    (clear b13)
    (clear b7)
    (clear b10)
    (clear b11)
    (clear b4)
    (handempty)
  )

  (:goal (and
    (ontable b6)
    (on b8 b6)
    (on b13 b8)
    (on b10 b13)
    (ontable b5)
    (on b4 b5)
    (on b7 b4)
    (on b9 b7)
    (ontable b12)
    (on b1 b12)
    (on b3 b1)
    (ontable b14)
    (on b2 b14)
    (on b11 b2)
  ))
)

; plan
1. (unstack b12 b1)
   deleted: (clear b12) (handempty) (on b12 b1)
   added: (holding b12) (clear b1)
   goals met: 2 of 14
2. (put-down b12)
   deleted: (holding b12)
   added: (clear b12) (handempty) (ontable b12)
   goals met: 3 of 14
3. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 3 of 14
4. (stack b1 b12)
   deleted: (holding b1) (clear b12)
   added: (clear b1) (handempty) (on b1 b12)
   goals met: 4 of 14
5. (unstack b3 b8)
   deleted: (clear b3) (handempty) (on b3 b8)
   added: (holding b3) (clear b8)
   goals met: 4 of 14
6. (stack b3 b1)
   deleted: (holding b3) (clear b1)
   added: (clear b3) (handempty) (on b3 b1)
   goals met: 5 of 14
7. (unstack b5 b6)
   deleted: (clear b5) (handempty) (on b5 b6)
   added: (holding b5) (clear b6)
   goals met: 5 of 14
8. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 6 of 14
9. (pick-up b8)
   deleted: (ontable b8) (clear b8) (handempty)
   added: (holding b8)
   goals met: 6 of 14
10. (stack b8 b6)
   deleted: (holding b8) (clear b6)
   added: (clear b8) (handempty) (on b8 b6)
   goals met: 7 of 14
11. (unstack b13 b14)
   deleted: (clear b13) (handempty) (on b13 b14)
   added: (holding b13) (clear b14)
   goals met: 7 of 14
12. (stack b13 b8)
   deleted: (holding b13) (clear b8)
   added: (clear b13) (handempty) (on b13 b8)
   goals met: 8 of 14
13. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 8 of 14
14. (stack b4 b5)
   deleted: (holding b4) (clear b5)
   added: (clear b4) (handempty) (on b4 b5)
   goals met: 9 of 14
15. (unstack b7 b2)
   deleted: (clear b7) (handempty) (on b7 b2)
   added: (holding b7) (clear b2)
   goals met: 9 of 14
16. (stack b7 b4)
   deleted: (holding b7) (clear b4)
   added: (clear b7) (handempty) (on b7 b4)
   goals met: 10 of 14
17. (unstack b10 b9)
   deleted: (clear b10) (handempty) (on b10 b9)
   added: (holding b10) (clear b9)
   goals met: 10 of 14
18. (stack b10 b13)
   deleted: (holding b10) (clear b13)
   added: (clear b10) (handempty) (on b10 b13)
   goals met: 11 of 14
19. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 11 of 14
20. (stack b2 b14)
   deleted: (holding b2) (clear b14)
   added: (clear b2) (handempty) (on b2 b14)
   goals met: 12 of 14
21. (pick-up b9)
   deleted: (ontable b9) (clear b9) (handempty)
   added: (holding b9)
   goals met: 12 of 14
22. (stack b9 b7)
   deleted: (holding b9) (clear b7)
   added: (clear b9) (handempty) (on b9 b7)
   goals met: 13 of 14
23. (pick-up b11)
   deleted: (ontable b11) (clear b11) (handempty)
   added: (holding b11)
   goals met: 13 of 14
24. (stack b11 b2)
   deleted: (holding b11) (clear b2)
   added: (clear b11) (handempty) (on b11 b2)
   goals met: 14 of 14
